### Import Modules

In [1]:
import pandas as pd
import numpy as np

### Create a dataframe

In [3]:
data = {'name': ['Raj', 'Bibek', 'Imran', 'Rabin', 'Pankaj'],
       'year': [2012,2012,2013,2014,2014],
       'reports': [4, 24, 31, 2, 3],
       'coverage': [25,94,57,62,70]}

df = pd.DataFrame(data, index =['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df

              name  year  reports  coverage
Cochice        Raj  2012        4        25
Pima         Bibek  2012       24        94
Santa Cruz   Imran  2013       31        57
Maricopa     Rabin  2014        2        62
Yuma        Pankaj  2014        3        70

### Create a capitalization lambda function

In [4]:
capitalizer = lambda x:x.upper()

### Apply the capitalizer function over the column 'name'

apply() can apply a function along any axis of the dataframe

In [5]:
df['name'].apply(capitalizer)

Cochice          RAJ
Pima           BIBEK
Santa Cruz     IMRAN
Maricopa       RABIN
Yuma          PANKAJ
Name: name, dtype: object

### Map the capitalizer lambda function over each element in the seies 'name'

map() applies an operatin over each element of a series

In [6]:
df['name'].map(capitalizer)

Cochice          RAJ
Pima           BIBEK
Santa Cruz     IMRAN
Maricopa       RABIN
Yuma          PANKAJ
Name: name, dtype: object

### Apply a square root function to every single cell in the whole data frame

applymap() applies a function to every single element in the entire dataframe

In [7]:
# Drop the string variable so that applymap() can run
df = df.drop('name', axis=1)

# Return the square root of every cell in the dataframe
df.applymap(np.sqrt)

                 year   reports  coverage
Cochice     44.855323  2.000000  5.000000
Pima        44.855323  4.898979  9.695360
Santa Cruz  44.866469  5.567764  7.549834
Maricopa    44.877611  1.414214  7.874008
Yuma        44.877611  1.732051  8.366600

### Applying A Function Over A Dataframe

#### Create a function that multiplies all non-strings by 100

In [8]:
# create a function called times100

def times100(x):
    # that, if x is a string,
    if type(x) is str:
        # just returns it untouched
        return x
    # but, if not, return it multiplied by 100
    elif x:
        return 100 * x
    else:
        return

### Apply the times100 over every cell in the dataframe

In [9]:
df.applymap(times100)

              year  reports  coverage
Cochice     201200      400      2500
Pima        201200     2400      9400
Santa Cruz  201300     3100      5700
Maricopa    201400      200      6200
Yuma        201400      300      7000